In [1]:
import pandas as pd

Create a Data Frame

In [6]:
data = pd.DataFrame({
  "Name": ["Romelu", "Cristiano", "Lionel", "Kilian", "Robert"],
  "Lastname": ["Lukaku", "Ronaldo", "Messi", "Mbappe", "Lewandowsky"],
  "Age": [27, 35, 33, 22, 32],
  "Height": [1.91, 1.87, 1.69, 1.78, 1.84],
  "Value": [80, 100, 150, 200, 120],
  "Misure Unit": ["milions", "milions", "milions", "milions", "milions"]  
})

data

        Name     Lastname  Age  Height  Value Misure Unit
0     Romelu       Lukaku   27    1.91     80     milions
1  Cristiano      Ronaldo   35    1.87    100     milions
2     Lionel        Messi   33    1.69    150     milions
3     Kilian       Mbappe   22    1.78    200     milions
4     Robert  Lewandowsky   32    1.84    120     milions

In [7]:
x = data ["Value"]

x

0     80
1    100
2    150
3    200
4    120
Name: Value, dtype: int64

In [8]:
x.describe

<bound method NDFrame.describe of 0     80
1    100
2    150
3    200
4    120
Name: Value, dtype: int64>

In [10]:
min (x)

80

In [11]:
max (x)

200

In [12]:
sum(x)

650

In [16]:
y = data ["Lastname"]

y

0         Lukaku
1        Ronaldo
2          Messi
3         Mbappe
4    Lewandowsky
Name: Lastname, dtype: object

In [27]:
y.describe

<bound method NDFrame.describe of 0         Lukaku
1        Ronaldo
2          Messi
3         Mbappe
4    Lewandowsky
Name: Lastname, dtype: object>